---
kind: method
id: M:Autodesk.Revit.DB.BIMExportOptions.Dispose
source: html/df23b65d-b40f-56e0-937a-d22e3870f292.htm
---
# Autodesk.Revit.DB.BIMExportOptions.Dispose Method

Releases all resources used by the BIMExportOptions

## Syntax (C#)
```csharp
public void Dispose()
```